//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum
{
	TEXTURE_TITLE_BG,
	TEXTURE_TITLE_MOON,
	TEXTURE_TITLE_BOX,
	TEXTURE_TITLE_TEXT,
	TEXTRUE_TITLE_STAR,
	TEXTURE_TITLE_MAX,
};



//*****************************************************************************
// 構造体
//*****************************************************************************
struct TITLE
{
	XMFLOAT3		pos;			// ポリゴンの座標
	float			w, h;			// 幅と高さ
	int				texNo;			// 使用しているテクスチャ番号
};

struct MOON
{
	XMFLOAT3		pos;			// ポリゴンの座標
	XMFLOAT3		rot;			// ポリゴンの回転量
	float			w, h;			// 幅と高さ
	float			countAnim;		// アニメーションカウント
	int				patternAnim;	// アニメーションパターンナンバー
	int				texNo;			// テクスチャ番号
};

struct CONFIRM
{
	XMFLOAT3		pos;			// ポリゴンの座標
	float			w, h;			// 幅と高さ
	int				texNo;			// 使用しているテクスチャ番号
	int				choose;			// 今選択したボタン
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);



