//=============================================================================
//
// チュートリアル画面処理 [tutorial.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum
{
	TEXTURE_TUTORIAL_1,
	TEXTURE_TUTORIAL_2,
	TEXTURE_TUTORIAL_3,
	TEXTURE_TUTORIAL_4,
	TEXTURE_TUTORIAL_TIPS_1,
	TEXTURE_TUTORIAL_TIPS_2,
	TEXTURE_TUTORIAL_MAX,
};

//*****************************************************************************
// 構造体
//*****************************************************************************
struct TUTORIAL
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		widtht;		// 幅
	float		height;		// 高さ
	int			texNo;		// 使用しているテクスチャ番号
	BOOL		use;		// 利用かどうか
	float		alpha;
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);
