//=============================================================================
//
// 武器のモデル処理 [waepon.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_WEAPON				(1)					// 武器の数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct WEAPON
{
	XMFLOAT3			pos;		// ポリゴンの位置
	XMFLOAT3			rot;		// ポリゴンの向き(回転)
	XMFLOAT3			scl;		// ポリゴンの大きさ(スケール)

	XMFLOAT4X4			mtxWorld;	// ワールドマトリックス

	BOOL				load;
	DX11_MODEL			model;		// モデル情報

	float				spd;		// 移動スピード
	float				dir;		// 向き
	BOOL				use;

	// 階層アニメーション用のメンバー変数
	INTERPOLATION_DATA* tbl_adr;	// アニメデータのテーブル先頭アドレス
	int					tbl_size;	// 登録したテーブルのレコード総数
	float				move_time;	// 実行時間

	// 親は、NULL、子供は親のアドレスを入れる
	WEAPON* parent;					// 自分が親ならNULL、自分が子供なら親のplayerアドレス

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWeapon(void);
void UninitWeapon(void);
void UpdateWeapon(void);
void DrawWeapon(void);

WEAPON* GetWeapon(void);

